experiments/r3.1b-threshold16384-3bucket-20260709-1822/raw/throughput_4-8K_rep2.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f403c1d0ca0>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=18001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='/public/home/xdzs2026_c166/Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./test/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-1438f968-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 18:43:53 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:15<00:00,  7.97s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [00:17<00:00,  5.88s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  17.63     
Total input tokens:                      19847     
Total generated tokens:                  172       
Request throughput (req/s):              0.17      
Output token throughput (tok/s):         9.76      
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1135.79   
---------------Time to First Token----------------
Mean TTFT (ms):                          1745.37   
Median TTFT (ms):                        1982.80   
P50 TTFT (ms):                           1982.80   
P95 TTFT (ms):                           2007.10   
P99 TTFT (ms):                           2009.26   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.41     
Median TPOT (ms):                        68.61     
P50 TPOT (ms):                           68.61     
P95 TPOT (ms):                           68.65     
P99 TPOT (ms):                           68.66     
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.35     
Median ITL (ms):                         68.60     
P50 ITL (ms):                            68.60     
P95 ITL (ms):                            69.47     
P99 ITL (ms):                            70.05     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          5606.83   
Median E2EL (ms):                        6198.00   
P50 E2EL (ms):                           6198.00   
P95 E2EL (ms):                           7776.33   
P99 E2EL (ms):                           7916.62   
==================================================

===== result files =====
./test/4-8K_throughput/result.json